_posts/2015-01-23-ideas-for-blog-posts.html
---
layout: page
title: Ideas For Blog Posts
permalink: /ideas/
categories: blogging
tags: ideas
description: Ideas for future posts.
front-page: false
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Emacs and RVM</h2>
<div class="outline-text-2" id="text-1">
<p>
Keywords: [development,rails,ruby,emacs]
</p>

<p>
Iron out issues getting my terminal in Emacs to work as expected
with RVM. Right now it is not picking up the propper gemset and
things are failing. But as always, the more I can do inside Emacs,
the quicker I can get things done.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Analysis of Jr Developer Salaries</h2>
<div class="outline-text-2" id="text-2">
<p>
Keywords: [data-analysis,R,glassdoor,career-development]
</p>

<p>
Pull data from glassdoor and see if we can't get a nice visual
representation of Jr Developer jobs across the country as well as
various languages, environments, etc.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Getting Sublime's Multiple Cursor Behavior in Emacs</h2>
<div class="outline-text-2" id="text-3">
<p>
Keywords: [emacs,elisp,sublime]
</p>

<p>
Describe how I got Sublime's multiple cursor functionality in Emacs.
</p>
</div>
</div>
